app/User.php

select * from `tasks` where `tasks`.`user_id` = 1 and `tasks`.`user_id` is not null and `done` = 1
---
    public function tasksDone()
    {
        return $this->tasks()->where('done', 1)->get();

select * from `tasks` where `tasks`.`user_id` = 1 and `tasks`.`user_id` is not null and `done` = 0
---
    public function tasksNotDone()
    {
        return $this->tasks()->where('done', 0)->get();