app/Http/Controllers/TaskController.php

insert into `tasks` (`user_id`, `task`, `done`, `updated_at`, `created_at`) values (1, 'test add', 0, '2020-10-26 16:06:38', '2020-10-26 16:06:38')
---
    public function store(TaskRequest $request)
    {
        $task = new Task;
        $task->user_id = Auth::id();
        $task->task = $request->task;
        $task->save();

update `tasks` set `done` = 0, `tasks`.`updated_at` = '2020-10-26 21:04:10' where `id` = 2
---
    public function update(Request $request, Task $task)
    {
        $task->done = !$task->done;
        $task->save();